In [2]:
## importing pandas
import pandas as pd

## Exercise 1: Create a new column called **professor_initials** that stores the initials of each professor's first and last names. Use the following data:

In [3]:
data = {
    'professor': ['Ludmila Kuncheva', 'Antonio Torralba', 'Manuel Gonzalez', 'Bastian Leibe'],
    'department': ['Computer Science', 'Computer Vision', 'AI & Robotics', 'Autonomous Systems'],
    'age': [45, 50, 47, 38]
}

df = pd.DataFrame(data)
df

          professor          department  age
0  Ludmila Kuncheva    Computer Science   45
1  Antonio Torralba     Computer Vision   50
2   Manuel Gonzalez       AI & Robotics   47
3     Bastian Leibe  Autonomous Systems   38

In [4]:
# splitting the name column and choosing the first letter in name and surname.
df['professor_initials'] = df['professor'].apply(lambda name: name.split()[0][0] + name.split()[1][0])

In [5]:
#displaying the new df
df

          professor          department  age professor_initials
0  Ludmila Kuncheva    Computer Science   45                 LK
1  Antonio Torralba     Computer Vision   50                 AT
2   Manuel Gonzalez       AI & Robotics   47                 MG
3     Bastian Leibe  Autonomous Systems   38                 BL

In [11]:
# printing each initial for name
for i in df.index:
    name = df["professor"][i]
    initial = df["professor_initials"][i]
    print(f"{name} has initials {initial}")

Ludmila Kuncheva has initials LK
Antonio Torralba has initials AT
Manuel Gonzalez has initials MG
Bastian Leibe has initials BL

## Exercise 2: Given the dataframe below. Use **join** to combine this new DataFrame with the original one based on the professor column.

In [12]:
courses_data = {
    'professor': ['Ludmila Kuncheva', 'Antonio Torralba', 'Manuel Gonzalez', 'Bastian Leibe'],
    'courses': ['Machine Learning', 'Computer Vision', 'AI Programming', 'Self-Driving Cars']
}
df_courses = pd.DataFrame(courses_data)

In [13]:
#setting the index based on the column "professor"
df_courses.set_index('professor', inplace=True)
#combining the dfs with join
df.join(df_courses, on='professor', how='inner')

,professor,department,age,professor_initials,courses
0,Ludmila Kuncheva,Computer Science,45,LK,Machine Learning
1,Antonio Torralba,Computer Vision,50,AT,Computer Vision
2,Manuel Gonzalez,AI & Robotics,47,MG,AI Programming
3,Bastian Leibe,Autonomous Systems,38,BL,Self-Driving Cars

## Exercise 3: Combine the original df and df_courses DataFrames.

In [31]:
data = {
    'professor': ['Ludmila Kuncheva', 'Antonio Torralba', 'Manuel Gonzalez', 'Bastian Leibe'],
    'department': ['Computer Science', 'Computer Vision', 'AI & Robotics', 'Autonomous Systems'],
    'age': [45, 50, 47, 38]
}

df = pd.DataFrame(data)

courses_data = {
    'professor': ['Ludmila Kuncheva', 'Antonio Torralba', 'Manuel Gonzalez', 'Bastian Leibe'],
    'courses': ['Machine Learning', 'Computer Vision', 'AI Programming', 'Self-Driving Cars']
}
df_courses = pd.DataFrame(courses_data)

In [32]:
#combining the dfs using merge
last_df = pd.merge(df, df_courses, on = "professor" , how="inner")

In [33]:
last_df

          professor          department  age            courses
0  Ludmila Kuncheva    Computer Science   45   Machine Learning
1  Antonio Torralba     Computer Vision   50    Computer Vision
2   Manuel Gonzalez       AI & Robotics   47     AI Programming
3     Bastian Leibe  Autonomous Systems   38  Self-Driving Cars

## Exercise 4: In the professor column, create a new column professor_last_name by extracting the last name of each professor using string operations.

In [21]:
#splitting the name column and choosing the last word as the last name and creating a new column based on the last name.
last_df["professor_last_name"] = last_df["professor"].str.split().str[-1]
last_df

,professor,department,age,courses,professor_last_name
0,Antonio Torralba,Computer Vision,50,Computer Vision,Torralba
1,Bastian Leibe,Autonomous Systems,38,Self-Driving Cars,Leibe
2,Ludmila Kuncheva,Computer Science,45,Machine Learning,Kuncheva
3,Manuel Gonzalez,AI & Robotics,47,AI Programming,Gonzalez

In [28]:
# printing each lastname for name
for i in last_df.index:
    name = last_df["professor"][i]
    lastname = last_df["professor_last_name"][i]
    print(f"{name} has initials {lastname}")

Antonio Torralba has initials Torralba
Bastian Leibe has initials Leibe
Ludmila Kuncheva has initials Kuncheva
Manuel Gonzalez has initials Gonzalez